## Movie Data

In [2]:
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt

In [3]:
!ls ../zippedData/

bom.movie_gross.csv.gz
im.db
im.db.zip
im2.db
rt.movie_info.tsv.gz
rt.reviews.tsv.gz
tmdb.movies.csv.gz
tn.movie_budgets.csv.gz

In [55]:
![image.png](attachment:image.png)

'[image.png]' is not recognized as an internal or external command,
operable program or batch file.

## IMDB MOVIE BASICS

In [4]:
conn = sqlite3.connect('../zippedData/im2.db')

In [5]:
pd.read_sql("SELECT * FROM sqlite_master", conn)

,type,name,tbl_name,rootpage,sql
0,table,movie_basics,movie_basics,2,"CREATE TABLE ""movie_basics"" (\n""movie_id"" TEXT..."
1,table,directors,directors,3,"CREATE TABLE ""directors"" (\n""movie_id"" TEXT,\n..."
2,table,known_for,known_for,4,"CREATE TABLE ""known_for"" (\n""person_id"" TEXT,\..."
3,table,movie_akas,movie_akas,5,"CREATE TABLE ""movie_akas"" (\n""movie_id"" TEXT,\..."
4,table,movie_ratings,movie_ratings,6,"CREATE TABLE ""movie_ratings"" (\n""movie_id"" TEX..."
5,table,persons,persons,7,"CREATE TABLE ""persons"" (\n""person_id"" TEXT,\n ..."
6,table,principals,principals,8,"CREATE TABLE ""principals"" (\n""movie_id"" TEXT,\..."
7,table,writers,writers,9,"CREATE TABLE ""writers"" (\n""movie_id"" TEXT,\n ..."

In [51]:
imdb_basics = pd.read_sql("SELECT * FROM movie_basics", conn)
imdb_basics.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [47]:
imdb_ratings = pd.read_sql("SELECT * FROM movie_ratings", conn)
imdb_ratings.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

## MOVIE GROSS

In [8]:
movie_gross = pd.read_csv("../zippedData/bom.movie_gross.csv.gz")
movie_gross.head(2)

                        title studio  domestic_gross foreign_gross  year
0                 Toy Story 3     BV     415000000.0     652000000  2010
1  Alice in Wonderland (2010)     BV     334200000.0     691300000  2010

In [9]:
movie_gross

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [10]:
movie_gross[movie_gross['title'] == 'Avatar']
#how to find the a specific movie

Empty DataFrame
Columns: [title, studio, domestic_gross, foreign_gross, year]
Index: []

In [11]:
type(movie_gross)

pandas.core.frame.DataFrame

In [12]:
movie_gross.index

RangeIndex(start=0, stop=3387, step=1)

In [13]:
movie_gross['foreign_gross'].sort_values(ascending=False)

1331      99700
1805      99700
302       99600
510     9900000
3181    9900000
         ...
3382        NaN
3383        NaN
3384        NaN
3385        NaN
3386        NaN
Name: foreign_gross, Length: 3387, dtype: object

In [14]:
movie_gross.columns

Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [15]:
movie_gross.values

array([['Toy Story 3', 'BV', 415000000.0, '652000000', 2010],
       ['Alice in Wonderland (2010)', 'BV', 334200000.0, '691300000',
        2010],
       ['Harry Potter and the Deathly Hallows Part 1', 'WB', 296000000.0,
        '664300000', 2010],
       ...,
       ['El Pacto', 'Sony', 2500.0, nan, 2018],
       ['The Swan', 'Synergetic', 2400.0, nan, 2018],
       ['An Actor Prepares', 'Grav.', 1700.0, nan, 2018]], dtype=object)

In [16]:
movie_gross.describe()

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

In [17]:
movie_gross.shape

(3387, 5)

In [18]:
movie_gross.mean()

domestic_gross    2.874585e+07
year              2.013958e+03
dtype: float64

In [19]:
movie_gross.min()

title              '71
domestic_gross     100
year              2010
dtype: object

In [20]:
movie_gross.max()

title             xXx: The Return of Xander Cage
domestic_gross                         9.367e+08
year                                        2018
dtype: object

In [22]:
movie_gross.describe(include=[object])

            title studio foreign_gross
count        3387   3382          2037
unique       3386    257          1204
top     Bluebeard    IFC       1200000
freq            2    166            23

In [23]:
movie_gross.head(1)

         title studio  domestic_gross foreign_gross  year
0  Toy Story 3     BV     415000000.0     652000000  2010

In [ ]:
movie_gross['tot_gross'] = movie_gross['foreign_gross'] + movie_gross['domestic_gross']

In [25]:
movie_gross['domestic_gross'] >= 500000000

0       False
1       False
2       False
3       False
4       False
        ...
3382    False
3383    False
3384    False
3385    False
3386    False
Name: domestic_gross, Length: 3387, dtype: bool

In [26]:
sum(movie_gross['domestic_gross'] >= 500000000)

9

In [27]:
big_bucks = movie_gross.loc[movie_gross['domestic_gross'] >= 500000000]

In [28]:
big_bucks

                             title studio  domestic_gross foreign_gross  year
727          Marvel's The Avengers     BV     623400000.0     895500000  2012
1872  Star Wars: The Force Awakens     BV     936700000.0       1,131.6  2015
1873                Jurassic World   Uni.     652300000.0       1,019.4  2015
2323  Rogue One: A Star Wars Story     BV     532200000.0     523900000  2016
2758      Star Wars: The Last Jedi     BV     620200000.0     712400000  2017
2759   Beauty and the Beast (2017)     BV     504000000.0     759500000  2017
3079        Avengers: Infinity War     BV     678800000.0       1,369.5  2018
3080                 Black Panther     BV     700100000.0     646900000  2018
3082                 Incredibles 2     BV     608600000.0     634200000  2018

In [29]:
movie_gross['year'].value_counts()
#change the variable out to get different counts for them all.

2015    450
2016    436
2012    400
2011    399
2014    395
2013    350
2010    328
2017    321
2018    308
Name: year, dtype: int64

In [30]:
movie_gross['studio'].sort_values()

155      3D
1457    A23
670     A23
1693    A24
1717    A24
       ...
210     NaN
555     NaN
933     NaN
1862    NaN
2825    NaN
Name: studio, Length: 3387, dtype: object

In [31]:
movie_gross.sort_values(by='domestic_gross')

,title,studio,domestic_gross,foreign_gross,year
1476,Storage 24,Magn.,100.0,NaN,2013
2321,The Chambermaid,FM,300.0,NaN,2015
2756,News From Planet Mars,KL,300.0,NaN,2016
2757,Satanic,Magn.,300.0,NaN,2016
1018,Apartment 143,Magn.,400.0,426000,2012
...,...,...,...,...,...
1975,Surprise - Journey To The West,AR,NaN,49600000,2015
2392,Finding Mr. Right 2,CL,NaN,114700000,2016
2468,Solace,LGP,NaN,22400000,2016
2595,Viral,W/Dim.,NaN,552000,2016
2825,Secret Superstar,NaN,NaN,122000000,2017

In [ ]:
sum(movie_gross['foreign_gross'] >= 500000000)

In [53]:
imdb_direc = pd.read_sql("SELECT * FROM directors", conn)
imdb_direc.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502

In [54]:
imdb_akas = pd.read_sql("SELECT * FROM movie_akas", conn)
imdb_akas.head()

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0

In [46]:
imdb_kfor = pd.read_sql("SELECT * FROM known_for ", conn)
imdb_kfor.head()

   person_id   movie_id
0  nm0061671  tt0837562
1  nm0061671  tt2398241
2  nm0061671  tt0844471
3  nm0061671  tt0118553
4  nm0061865  tt0896534

In [48]:
imdb_persons = pd.read_sql("SELECT * FROM persons", conn)
imdb_persons.head()

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator"

In [49]:
imdb_princ = pd.read_sql("SELECT * FROM principals", conn)
imdb_princ.head()

    movie_id  ordering  person_id  category       job        characters
0  tt0111414         1  nm0246005     actor      None       ["The Man"]
1  tt0111414         2  nm0398271  director      None              None
2  tt0111414         3  nm3739909  producer  producer              None
3  tt0323808        10  nm0059247    editor      None              None
4  tt0323808         1  nm3579312   actress      None  ["Beth Boothby"]

In [50]:
imdb_writers = pd.read_sql("SELECT * FROM writers", conn)
imdb_writers.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0438973  nm0175726
2  tt0438973  nm1802864
3  tt0462036  nm1940585
4  tt0835418  nm0310087

## TMDB MOVIES

In [33]:
tmdb_mov = pd.read_csv("../zippedData/tmdb.movies.csv.gz")

In [34]:
tmdb_mov.head(1)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788

In [35]:
tmdb_mov.tail(1)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
26516,26516,"[53, 27]",309885,en,The Church,0.6,2018-10-05,The Church,0.0,1

## MOVIE BUDGETS

In [36]:
budg_mov = pd.read_csv("../zippedData/tn.movie_budgets.csv.gz")

In [37]:
budg_mov.head(1)

   id  release_date   movie production_budget domestic_gross worldwide_gross
0   1  Dec 18, 2009  Avatar      $425,000,000   $760,507,625  $2,776,345,279

In [38]:
budg_mov.tail(1)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [39]:
budg_mov.mean()

id    50.372363
dtype: float64

In [40]:
budg_mov.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [41]:
budg_mov.describe()

                id
count  5782.000000
mean     50.372363
std      28.821076
min       1.000000
25%      25.000000
50%      50.000000
75%      75.000000
max     100.000000

In [42]:
budg_mov.describe(include=[object])

,release_date,movie,production_budget,domestic_gross,worldwide_gross
count,5782,5782,5782,5782,5782
unique,2418,5698,509,5164,5356
top,"Dec 31, 2014",Halloween,"$20,000,000",$0,$0
freq,24,3,231,548,367

In [43]:
budg_mov.shape

(5782, 6)

In [44]:
budg_mov['domestic_gross']

0       $760,507,625
1       $241,063,875
2        $42,762,350
3       $459,005,868
4       $620,181,382
            ...
5777              $0
5778         $48,482
5779          $1,338
5780              $0
5781        $181,041
Name: domestic_gross, Length: 5782, dtype: object

In [45]:
budg_mov['worldwide_gross']

0       $2,776,345,279
1       $1,045,663,875
2         $149,762,350
3       $1,403,013,963
4       $1,316,721,747
             ...
5777                $0
5778          $240,495
5779            $1,338
5780                $0
5781          $181,041
Name: worldwide_gross, Length: 5782, dtype: object